title: Google search
id: f6935d71-bb4d-4918-8877-0afd9208b5b4
status: experimental
description: Google searches based on URL structure
references: 
  - https://bitbucket.org/chrishargreaves/pydft-analysers/src/master/Analysers/Web/GoogleSearch.py
  - https://serpapi.com/blog/google-search-parameters/
tags:
  - web_browsing
  - search_activity
  - google
author: Jony Patterson, Hudan Studiawan, Java Kanaya Prada
date: 2024/06/29
modified: 2025/02/04
logsource:
  product: 
    - firefox
    - chromium
  service:
    - sqlite/firefox_history
    - sqlite/chrome_27_history
detection:
  keywords:
    '|all|re':
      - 'WEBHIST'
      - 'https?:\/\/'  
      - 'www\.google\.(com|co\.[a-z]{2})' 
      - '\/search\?.*q=' 
  condition: keywords
level: informational
category: Web
high_level_event:
  type: Google Search
  description: Google Search for {keys[Search_Term]}
  keys:
    - name: Browser 
      source: get_browser
    - name: Search_Term
      source: extract_google_search_term
reasoning:
  description: The source WEBHIST was found in {plugin}, and Google Search URL found in {evidence}



