title: Web visit to domain
id: 8e947e1a-313f-4c8f-bf3a-b0fd181ce879
status: experimental
description: Web Visit
tags:
  - 
author: Java Kanaya Prada
date: 2024/10/14
modified: 2025/02/04
logsource:
  product: 
    - firefox
    - chromium
  service:
    - sqlite/firefox_history
    - sqlite/chrome_27_history
detection:
  keywords:
    '|all|re':
      - 'WEBHIST'
      - 'https?:\/\/' 
      - 'www.'
  condition: keywords
level: informational
category: Web Overview
high_level_event:
  type: Web Visit
  description: Web Visit to {keys[Domain]}
  keys:
    - name: Browser 
      source: get_browser
    - name: URL
      source: extract_url
    - name: Domain
      source: extract_domain_from_url
reasoning:
  description: URL found in {evidence}



